; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	thermograph1 - mode
	infrared2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 105)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 180)
	(= (data Star5 infrared0) 273)
	(= (data Planet6 infrared0) 97)
	(= (data Star7 infrared0) 242)
	(= (data Planet8 infrared0) 20)
	(= (data Star5 thermograph1) 200)
	(= (data Planet6 thermograph1) 16)
	(= (data Star7 thermograph1) 58)
	(= (data Planet8 thermograph1) 150)
	(= (data Star5 infrared2) 69)
	(= (data Planet6 infrared2) 242)
	(= (data Star7 infrared2) 81)
	(= (data Planet8 infrared2) 36)
	(= (slew_time GroundStation2 GroundStation0) 75.02)
	(= (slew_time GroundStation0 GroundStation2) 75.02)
	(= (slew_time GroundStation2 GroundStation1) 30.75)
	(= (slew_time GroundStation1 GroundStation2) 30.75)
	(= (slew_time Star4 GroundStation0) 15.12)
	(= (slew_time GroundStation0 Star4) 15.12)
	(= (slew_time Star4 GroundStation1) 43.9)
	(= (slew_time GroundStation1 Star4) 43.9)
	(= (slew_time Star4 GroundStation2) 10.55)
	(= (slew_time GroundStation2 Star4) 10.55)
	(= (slew_time Star4 Star3) 2.429)
	(= (slew_time Star3 Star4) 2.429)
	(= (slew_time GroundStation1 GroundStation0) 61.77)
	(= (slew_time GroundStation0 GroundStation1) 61.77)
	(= (slew_time Star3 GroundStation0) 60.83)
	(= (slew_time GroundStation0 Star3) 60.83)
	(= (slew_time Star3 GroundStation1) 23.23)
	(= (slew_time GroundStation1 Star3) 23.23)
	(= (slew_time Star3 GroundStation2) 51.87)
	(= (slew_time GroundStation2 Star3) 51.87)
	(= (slew_time Star5 GroundStation0) 19.72)
	(= (slew_time GroundStation0 Star5) 19.72)
	(= (slew_time Star5 GroundStation1) 2.968)
	(= (slew_time GroundStation1 Star5) 2.968)
	(= (slew_time Star5 GroundStation2) 60.44)
	(= (slew_time GroundStation2 Star5) 60.44)
	(= (slew_time Star5 Star3) 15.39)
	(= (slew_time Star3 Star5) 15.39)
	(= (slew_time Star5 Star4) 18.72)
	(= (slew_time Star4 Star5) 18.72)
	(= (slew_time Planet6 GroundStation0) 0.9441)
	(= (slew_time GroundStation0 Planet6) 0.9441)
	(= (slew_time Planet6 GroundStation1) 42.92)
	(= (slew_time GroundStation1 Planet6) 42.92)
	(= (slew_time Planet6 GroundStation2) 12.77)
	(= (slew_time GroundStation2 Planet6) 12.77)
	(= (slew_time Planet6 Star3) 64.78)
	(= (slew_time Star3 Planet6) 64.78)
	(= (slew_time Planet6 Star4) 68.77)
	(= (slew_time Star4 Planet6) 68.77)
	(= (slew_time Planet6 Star5) 17.58)
	(= (slew_time Star5 Planet6) 17.58)
	(= (slew_time Star7 GroundStation0) 17.6)
	(= (slew_time GroundStation0 Star7) 17.6)
	(= (slew_time Star7 GroundStation1) 46.42)
	(= (slew_time GroundStation1 Star7) 46.42)
	(= (slew_time Star7 GroundStation2) 14.07)
	(= (slew_time GroundStation2 Star7) 14.07)
	(= (slew_time Star7 Star3) 49.85)
	(= (slew_time Star3 Star7) 49.85)
	(= (slew_time Star7 Star4) 40.52)
	(= (slew_time Star4 Star7) 40.52)
	(= (slew_time Star7 Star5) 62.74)
	(= (slew_time Star5 Star7) 62.74)
	(= (slew_time Star7 Planet6) 25.03)
	(= (slew_time Planet6 Star7) 25.03)
	(= (slew_time Planet8 GroundStation0) 15.38)
	(= (slew_time GroundStation0 Planet8) 15.38)
	(= (slew_time Planet8 GroundStation1) 10.11)
	(= (slew_time GroundStation1 Planet8) 10.11)
	(= (slew_time Planet8 GroundStation2) 5.246)
	(= (slew_time GroundStation2 Planet8) 5.246)
	(= (slew_time Planet8 Star3) 33.74)
	(= (slew_time Star3 Planet8) 33.74)
	(= (slew_time Planet8 Star4) 20.84)
	(= (slew_time Star4 Planet8) 20.84)
	(= (slew_time Planet8 Star5) 14.88)
	(= (slew_time Star5 Planet8) 14.88)
	(= (slew_time Planet8 Planet6) 27.9)
	(= (slew_time Planet6 Planet8) 27.9)
	(= (slew_time Planet8 Star7) 25.04)
	(= (slew_time Star7 Planet8) 25.04)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Planet8)
	(have_image Star5 thermograph1)
	(have_image Planet6 infrared2)
	(have_image Star7 thermograph1)
	(have_image Planet8 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 180 to 174.754, (fuel-used) from 0 to 5.246
   goals met: 0 of 6
2. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 105 to 87.4, (fuel-used) from 5.246 to 22.846
   goals met: 1 of 6
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
4. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 174.754 to 164.204, (fuel-used) from 22.846 to 33.396
   goals met: 1 of 6
5. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 164.204 to 153.654, (fuel-used) from 33.396 to 43.946
   goals met: 1 of 6
7. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 1 of 6
8. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 153.654 to 143.104, (fuel-used) from 43.946 to 54.496
   goals met: 1 of 6
9. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 143.104 to 132.554, (fuel-used) from 54.496 to 65.046
   goals met: 1 of 6
10. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 132.554 to 122.004, (fuel-used) from 65.046 to 75.596
   goals met: 1 of 6
11. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 122.004 to 111.454, (fuel-used) from 75.596 to 86.146
   goals met: 1 of 6
12. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 111.454 to 106.208, (fuel-used) from 86.146 to 91.392
   goals met: 2 of 6
13. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 87.4 to 86.4559, (fuel-used) from 91.392 to 92.3361
   goals met: 1 of 6
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 6
15. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 106.208 to 72.468, (fuel-used) from 92.3361 to 126.076
   goals met: 0 of 6
16. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 6
17. (turn_to satellite1 star5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 72.468 to 57.078, (fuel-used) from 126.076 to 141.466
   goals met: 0 of 6
18. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 86.4559 to 85.5118, (fuel-used) from 141.466 to 142.41
   goals met: 1 of 6
19. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
20. (turn_to satellite0 star4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 85.5118 to 70.3918, (fuel-used) from 142.41 to 157.53
   goals met: 0 of 6
21. (take_image satellite1 star5 instrument3 thermograph1)
   added: (have_image star5 thermograph1)
   changed: (data_capacity satellite1) from 1000 to 800, (data-stored) from 0 to 200
   goals met: 1 of 6
22. (turn_to satellite1 planet8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 57.078 to 42.198, (fuel-used) from 157.53 to 172.41
   goals met: 2 of 6
23. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 70.3918 to 55.2718, (fuel-used) from 172.41 to 187.53
   goals met: 3 of 6
24. (take_image satellite1 planet8 instrument3 infrared2)
   added: (have_image planet8 infrared2)
   changed: (data_capacity satellite1) from 800 to 764, (data-stored) from 200 to 236
   goals met: 4 of 6
25. (turn_to satellite1 groundstation2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 42.198 to 36.952, (fuel-used) from 187.53 to 192.776
   goals met: 3 of 6
26. (turn_to satellite1 star7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 36.952 to 22.882, (fuel-used) from 192.776 to 206.846
   goals met: 3 of 6
27. (take_image satellite1 star7 instrument3 thermograph1)
   added: (have_image star7 thermograph1)
   changed: (data_capacity satellite1) from 764 to 706, (data-stored) from 236 to 294
   goals met: 4 of 6
28. (turn_to satellite1 groundstation2 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 22.882 to 8.812, (fuel-used) from 206.846 to 220.916
   goals met: 4 of 6
29. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 8.812 to 3.566, (fuel-used) from 220.916 to 226.162
   goals met: 5 of 6
30. (turn_to satellite0 star4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 55.2718 to 40.1518, (fuel-used) from 226.162 to 241.282
   goals met: 4 of 6
31. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 40.1518 to 37.7228, (fuel-used) from 241.282 to 243.711
   goals met: 4 of 6
32. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 4 of 6
33. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 37.7228 to 35.2938, (fuel-used) from 243.711 to 246.14
   goals met: 4 of 6
34. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 35.2938 to 20.1738, (fuel-used) from 246.14 to 261.26
   goals met: 5 of 6
35. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 20.1738 to 19.2297, (fuel-used) from 261.26 to 262.204
   goals met: 4 of 6
36. (take_image satellite0 planet6 instrument0 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite0) from 1000 to 758, (data-stored) from 294 to 536
   goals met: 5 of 6
37. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 19.2297 to 18.2856, (fuel-used) from 262.204 to 263.148
   goals met: 6 of 6
